datasets/hcc/opendj-sdk/queries/long/618.txt

If the provided HTTP credentials are correct, and the user sends an <AuthRequest>, no <AuthResponse><resultCode code="0"/></AuthResponse> is returned.

If the connection fails, we don't return an <AuthResponse> either, we return a <errorResponse>. The DSMLv2 spec suggests this is only an appropriate response for a syntax error/malformed request.

An entry matching uid=esb was created with a password of "password" in order for SASL PLAIN to work.

Test data:


$ cat /tmp/authadd.xml 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<core:batchRequest xmlns:core="urn:oasis:names:tc:DSML:2:0:core">
<core:authRequest principal="dn:uid=esb,ou=admin accounts,dc=example,dc=com"/>
<core:addRequest dn="uid=uid_dv1b_AAA-AS_DSML_CREATE_001,ou=People,dc=example,dc=com">
<core:attr name="cn">
<core:value>CN-uid_dv1b_AAA-AS_DSML_CREATE_001</core:value>
</core:attr>
<core:attr name="givenName">
<core:value>CN-uid_dv1b_AAA-AS_DSML_CREATE_001 SN-uid_dv1b_AAA-AS_DSML_CREATE_001</core:value>
</core:attr>
<core:attr name="mail">
<core:value>uid_dv1b_AAA-AS_DSML_CREATE_001@example.com</core:value>
</core:attr>
<core:attr name="objectClass">
<core:value>top</core:value>
<core:value>person</core:value>
<core:value>organizationalPerson</core:value>
<core:value>inetOrgPerson</core:value>
</core:attr>
<core:attr name="preferredLanguage">
<core:value>en-US</core:value>
</core:attr>
<core:attr name="sn">
<core:value>SN-uid_dv1b_AAA-AS_DSML_CREATE_001</core:value>
</core:attr>
<core:attr name="telephoneNumber">
<core:value>0123456789</core:value>
</core:attr>
<core:attr name="uid">
<core:value>uid_dv1b_AAA-AS_DSML_CREATE_001</core:value>
</core:attr>
</core:addRequest>
</core:batchRequest>
</soapenv:Body>
</soapenv:Envelope>



Using an incorrect password:


$ curl -X POST --data @/tmp/authadd.xml -H "Content-Type: text/xml" -u esb:password2 http://localhost:8080/dsml/DSMLServlet
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
 <SOAP-ENV:Body>
  <batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core">
   <errorResponse type="couldNotConnect">
    <message>org.opends.server.tools.LDAPConnectionException: The SASL PLAIN bind attempt failed</message>
   </errorResponse>
  </batchResponse>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>



Using a correct password:


$ curl -X POST --data @/tmp/authadd.xml -H "Content-Type: text/xml" -u esb:password http://localhost:8080/dsml/DSMLServlet
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
 <SOAP-ENV:Body>
  <batchResponse xmlns="urn:oasis:names:tc:DSML:2:0:core">
   <addResponse><resultCode code="50"/><errorMessage>The entry uid=uid_dv1b_AAA-AS_DSML_CREATE_001,ou=People,dc=example,dc=com cannot be added due to insufficient access rights</errorMessage></addResponse>
  </batchResponse>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

